[
  {
    "title": "Eclipse Hunter",
    "category": "Jeu de plateforme",
    "classTitre": "titreSectionEclipse",
    "images": [
      "./assets/img/projet-1.png",
      "./assets/img/projetEclipse2.png",
      "./assets/img/projetEclipse3.png"
    ],
    "description": "Un court jeu de plateforme développé sur phaser dans le cadre de mon cours d'intégration multimédia. Nous incarnons un chevalier dans un montre rétro furitiste qui devra affronter le grand méchant boss qui invoque des 'slimes' sur toute la carte. Dans ce projet, j'ai conçu l'intégralité de la carte grâce au logiciel 'tiled', du design visuel et sonore en réutilisant des assets gratuits et libres de droits, ainsi que le code du jeu via Phaser. J'ai également été en charge.. du cahier de charges du projet. J'ai dû évaluer ce qui était possible ou non, et au fil du temps paufiner mon projet afin de respecter les délais.",
    "lien": "https://donpatchi.itch.io/eclipse-hunter"
  },
  {
    "title": "Bandit VR",
    "category": "Réalité virtuelle",
    "classTitre": "titreSectionBandit",
    "images": [
      "./assets/img/projet-2.png",
      "./assets/img/projetVr2.png",
      "./assets/img/projetVr3.png"
    ],
    "description": "Jeu en réalité virtuelle inspiré du célèbre jeu Frogger, jouable avec OSC. Ce projet a été réalisé en équipe avec Raphaël Angon Dubé ainsi que Thearylou Lach. J'ai été en charge d'une grande partie de la programmation ainsi que de la conception complète de la carte du jeu, Raphael quant à lui s'est occupé d'un processus de conception des idées ainsi qu'une partie de la programmation, Thearylou s'est occupé de la partie OSC et d'une partie de la programmation également. Le tout a été développé sur Unity et TouchDesigner, et le projet a été encadré par notre professeur Loras Boisvert en Réalité Mixte.",
    "lien": "https://github.com/Rafael-ADube/unity_bandit-go/tree/main"
  },
  {
    "title": "La Machine",
    "category": "Vidéo en stop-motion",
    "classTitre": "titreSectionMachine",
    "images": [
      "./assets/img/projet-3.png",
      "./assets/img/projetMachine2.png",
      "./assets/img/projetMachine3.png"
    ],
    "description": "Une vidéo en stop motion où le protagoniste, Jacque, découvre une machine à écrire mystérieuse... Ce projet a été réalisé en équipe avec Justin Monpetit, Radhouane Kordan et Félix Lévesque. Nous avons utilisé le logiciel Dragonframe pour le stop motion, DaVinci pour le montage vidéo, After Effects pour les animations 2D, Illustrator pour l'illustration 2D et Reaper pour la création sonore. On a tous travaillé de manière égale dans chacun des processus de créations, cependant l'acteur principal de la vidéo est Justin Montpetit.",
    "lien": "https://youtu.be/1P9nsghhglc"
  },
  {
    "title": "Prof Chaos",
    "category": "RPG humoristique",
    "classTitre": "titreSectionProf",
    "images": [
      "./assets/img/projet-4.png",
      "./assets/img/projetProf2.png",
      "./assets/img/projetProf3.png"
    ],
    "description": "Un jeu RPG humoristique développé sur RPG Bakin, conçu pour taquiner un ami portant le pseudonyme 'Professeur Chaos'. À la suite d'une anecdote complètement anodine racontée par 'profchaos', le protagoniste du jeu part à la recherche de la personne ayant 'demandé'. L'intégralité des assets provient du moteur. La création du jeu a été réalisée en programmant 'visuellement', à l'aide d'un système proposé par l'engine.",
    "lien": "https://vimeo.com/1131137885",
    "processus": [
      {
        "titre": "Création du projet et conception de la carte",
        "texte": "En premier lieu, nous créons le projet et concevons la carte du jeu.",
        "image": "./assets/img/processusCreation1.png"
      },
      {
        "titre": "Mise en place des événements",
        "texte": "Ensuite, nous devons procéder à la mise en place des événements qui rythmeront le jeu.",
        "image": "./assets/img/processusCreation2.png"
      },
      {
        "titre": "Rédaction du scénario et des dialogues",
        "texte": "Nous écrivons le script principal du jeu ainsi que les divers dialogues entre les personnages.",
        "image": "./assets/img/processusCreation3.png"
      },
      {
        "titre": "Tests des combats",
        "texte": "Nous réalisons des tests approfondis des combats pour assurer un bon équilibre du gameplay.",
        "image": "./assets/img/processusCreation4.png"
      },
      {
        "titre": "Création des boss",
        "texte": "Enfin, nous créons les boss que les joueurs devront affronter à la fin de chaque niveau ou chapitre.",
        "image": "./assets/img/processusCreation5.png"
      },
      {
        "titre": "Derniers ajustements",
        "texte": "Quelques ajustements visuels et techniques sont apportés avant la version finale.",
        "image": "./assets/img/processusCreation6.png"
      }
    ]
  }
]